---
kind: other
id: Methods.T:Autodesk.Revit.UI.Events.TaskDialogShowingEventArgs
source: html/04a360d5-cdce-08dd-7b9f-5f3983268849.htm
---
# TaskDialogShowingEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.